xrun: 22.03-s012: (c) Copyright 1995-2023 Cadence Design Systems, Inc.
TOOL:	xrun	22.03-s012: Started on Aug 25, 2024 at 22:14:01 CDT
xrun
	-f run.f
		+access+rwc
		-timescale 1ns/1ns
		-gui
		-incdir ../design/common
		../design/common/addr_segregator_proc.sv
		../tb/tb_addr_segregator_proc.sv
Recompiling... reason: unable to stat '/./home/faculty/d/davidkebo/davidkebo/csce616/2024_fall/source/labs/lab-0/work/design/common/addr_segregator_proc.sv'.
file: ../tb/tb_addr_segregator_proc.sv
xmvlog: *W,SPDUSD: Include directory ../design/common given but not used.
	Total errors/warnings found outside modules and primitives:
		errors: 0, warnings: 1
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		tb_addr_segregator_proc
xmelab: *W,DSEMEL: This SystemVerilog design will be simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
	Building instance overlay tables: .................... Done
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 2       2
		Registers:               7       7
		Scalar wires:            2       -
		Vectored wires:          4       -
		Always blocks:           1       1
		Initial blocks:          2       2
		Pseudo assignments:      3       3
		Simulation timescale:  1ns
	Writing initial simulation snapshot: worklib.tb_addr_segregator_proc:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
xmsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /opt/coe/cadence/XCELIUM/tools/xcelium/files/xmsimrc
xcelium> run 100ns
Ran until 100 NS + 0
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm tb_addr_segregator_proc.address tb_addr_segregator_proc.blk_offset_proc tb_addr_segregator_proc.cmd_rd tb_addr_segregator_proc.cmd_wr
Created probe 1
xcelium> reset
xmsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
Loaded snapshot worklib.tb_addr_segregator_proc:sv
xcelium> run
Simulation complete via $finish(1) at time 120 NS + 0
../tb/tb_addr_segregator_proc.sv:62       #10 $finish;
xcelium> ^C
xcelium> exit
TOOL:	xrun	22.03-s012: Exiting on Aug 25, 2024 at 22:21:26 CDT  (total: 00:07:25)
